lvx/base/DataProcessors/бит_РедактированиеДопРеквизитовДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_РедактированиеДопРеквизитовДоговора</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВысокийПриоритетПриЗаполненииАналитик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СостояниеДоговора</Name>
					<Comment>Состояние договора</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СостоянияДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ПредметДоговора</Name>
					<Comment>Предмет договора</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ОписаниеРабот</Name>
					<Comment>Описание работ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ОсновнаяСтатьяОборотов</Name>
					<Comment>Основная статья оборотов (БДДС)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ОсновнаяСтатьяОборотовБДР</Name>
					<Comment>Основная статья оборотов (БДР)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ЦФО</Name>
					<Comment>Центр финансовой ответственности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СуммаДоговора</Name>
					<Comment>Сумма договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ПроектДоговора</Name>
					<Comment>Проект договора</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НаправлениеДоговора</Name>
					<Comment>Направление договора</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НаправленияДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СпособРасчетаФинПлатежей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыРасчетовГрафиковПлатежейПоФинДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_НачалоПлановое</Name>
					<Comment>Начало плановое</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ОкончаниеПлановое</Name>
					<Comment>Окончание плановое</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ФактическоеНачало</Name>
					<Comment>Фактическое начало</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ФактическоеОкончание</Name>
					<Comment>Фактическое окончание</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СтадияДоговора</Name>
					<Comment>Стадия договора</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСтадийДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ШтрафнойПроцентОтСуммыЗаПериод</Name>
					<Comment>Штрафной процент от суммы за период</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ШтрафнаяСуммаЗаПериод</Name>
					<Comment>Штрафная сумма за период</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_БазовыйПериодИсчисленияПериода</Name>
					<Comment>Базовый период исчисления периода</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ПодразделениеОрганизации</Name>
					<Comment>Подразделение-инициатор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВключатьВРеестрДоговоров</Name>
					<Comment>Включать в реестр договоров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВключатьВРеестр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_ВалютаВзаиморасчетов</Name>
					<Comment>Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КурсВзаиморасчетов</Name>
					<Comment>Курс взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СуммаНДСВзаиморасчеты</Name>
					<Comment>Сумма НДС по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_РасчетыВУсловныхЕдиницах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>бит_СтатьиОборотов</Name>
					<Comment>Статьи оборотов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасходДоход</Name>
							<Comment>Направление - расход/доход</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_РасходДоход</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Comment>Статья оборотов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Documents/бит_Претензия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_Претензия</Name>
			<Comment>Претензия (БИТ)</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПретензионноеИсковоеНаправление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПретензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПретензии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметПретензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/DataProcessors/бит_РедактированиеДопРеквизитовДоговора/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаАктивна; // Хранит признак активности формы.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АвтоТест", Ложь) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.Обработки.бит_РедактированиеДопРеквизитовДоговора;
	
	Параметры.Свойство("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	
	Если НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		бит_ОбщегоНазначения.СообщитьОбОтказеОткрытияОбработкиСамостоятельно(МетаданныеОбъекта.Синоним, Отказ); 
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	ЗакрыватьПриЗакрытииВладельца = Истина;
	
	ДатаСведенийМУ = ТекущаяДатаСеанса();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	фКэшРеквизитов = Новый Структура;
		
	// Установим параметры для списка документов исков и претензий.
	УстановитьПараметрыДляСпискаТребованийИсков();

	// Запомним текущие значения реквизитов формы.
	ЗаполнитьКэшРеквизитовФормы();

	ЗаполнитьКэшЗначений();

	ГрафикВыдачиТраншей.Параметры.УстановитьЗначениеПараметра("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
		
	ЭлементОтбора = ДопУсловияПоДоговору.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДоговорКонтрагента");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  =  Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.ДоговорКонтрагента;
	
	// Видимость элементов.
	Элементы.ГруппаСтраницаПараметрыФинИнструментовМСФО.Видимость = мКэшЗначений.ЕстьОбъектыМСФО;
		
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ЭтотОбъект, "ГрафикПлатежей");
	бит_МеханизмДопИзмерений.ОтобразитьДополнительныеИзмеренияВТабличномПоле_Управляемая(ЭтотОбъект, "ГрафикНачислений");

	Если НЕ ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
		УстановитьОтборДляСпискаСобытий();
	КонецЕсли;
	
	УправлениеВидимостьюЭлементовТЧ("ГрафикПлатежейАналитика_");
	УправлениеВидимостьюЭлементовТЧ("ГрафикНачисленийАналитика_");
                                
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФормаАктивна = Истина;
	
	ПрочитатьДанныеДоговораКонтрагента();
	
	ИзменениеДанныхРазрешено();
	
	ПодключитьОбработчикОжидания("ПроверитьАктивностьФормы", 1, Ложь);
	
	УстановитьОтборПараметрыФинИнструментовМУ();
	
	// Рассчитаем сумму без НДС для отображения на форме.
	РассчитатьСуммуБезНДС();

	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность И НЕ мКэшЗначений.ЗакрытиеФормы Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ИзменениеДопРеквизитов",ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Дополнительные реквизиты договора ""%1"" были изменены. Сохранить изменения?';
							|en='Additional details of the agreement ""%1"" have been changed. Save changes?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, Объект.ДоговорКонтрагента);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		мКэшЗначений.ЗакрытиеФормы = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработка вопроса изменения дополнительных реквизитов.
// 
&НаКлиенте 
Процедура ИзменениеДопРеквизитов(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда		
		СохранитьИзменения();		
		ВыполнитьПослеЗаписи();				
	КонецЕсли;	
	
	Если ЭтотОбъект.Окно <> Неопределено Тогда
		ЭтотОбъект.Закрыть();
	КонецЕсли;
	Если ЭтотОбъект.ВладелецФормы <> Неопределено Тогда
		ЭтотОбъект.ВладелецФормы.Закрыть();
	КонецЕсли;
		
КонецПроцедуры // ИзменениеДопРеквизитов()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура бит_ЦФОПриИзменении(Элемент)
	
	ПриИзмененииЦФОСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ТипДоговораПриИзменении(Элемент)
	
	бит_ТипДоговораПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СпособРасчетаФинПлатежейПриИзменении(Элемент)
	
	ЗаполнитьПараметрыФинансовогоДоговора(Объект.бит_СпособРасчетаФинПлатежей);
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ЗначенияПараметровФинДоговоров,ЗначенияПараметровФинДоговоров.ПолучитьЭлементы(),Истина);

КонецПроцедуры

&НаКлиенте
Процедура бит_НаправлениеДоговораПриИзменении(Элемент)
	
	бит_НаправлениеДоговораПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСведенийМУПриИзменении(Элемент)
	
	УстановитьОтборПараметрыФинИнструментовМУ();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СуммаДоговораПриИзменении(Элемент)
	
	РассчитатьСуммуНДС();
	РассчитатьСуммуБезНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуНДС();
	РассчитатьСуммуБезНДС();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСобытий

&НаКлиенте
Процедура СписокСобытийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		
		Если Модифицированность Тогда
			Модифицированность = НЕ СохранитьИзменения();
			ВыполнитьПослеЗаписи();
		КонецЕсли;
		
	Иначе

		Если Модифицированность  Тогда
			
			ТекстВопроса = НСтр("ru='Данные изменены. Перед началом работы с событиями данные необходимо записать. Записать?';
								|en='Data has changed. Before working with the events of the data to be written. Record?'");
			ОповещениеВопрос = Новый ОписаниеОповещения("ВопросСписокСобытийПередНачаломДобавления", ЭтотОбъект, "Добавление");			
			ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30,,);
			
		Иначе
			
			Если Объект.бит_СуммаДоговора > 0 Тогда
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Договор"    , Объект.ДоговорКонтрагента);
				ПараметрыФормы.Вставить("Контрагент" , ВладелецФормы.Объект.Контрагент);
		        ПараметрыФормы.Вставить("Организация", ВладелецФормы.Объект.Организация);
				
				ОткрытьФорму("Документ.бит_СобытиеДоговора.Форма.ФормаДокумента", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
			Иначе
				
				ТекстСообщения = НСтр("ru='Перед добавлением событий, необходимо ввести сумму договора.';
									  |en='Before adding events, you must enter the amount of the contract.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;

		КонецЕсли;	

		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработка оповещения вопроса пользователю. 
//
// Параметры:
//  Параметр1 - Строка.
//
&НаКлиенте
Процедура ВопросСписокСобытийПередНачаломДобавления(Ответ, ВариантРедактирования) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Модифицированность = НЕ СохранитьИзменения();
		ВыполнитьПослеЗаписи();

		Если ВариантРедактирования = "Добавление" Тогда
			Если Объект.бит_СуммаДоговора > 0 Тогда
			
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Договор"    , Объект.ДоговорКонтрагента);
				ПараметрыФормы.Вставить("Контрагент" , ВладелецФормы.Объект.Контрагент);
		        ПараметрыФормы.Вставить("Организация", ВладелецФормы.Объект.Организация);
				
				ОткрытьФорму("Документ.бит_СобытиеДоговора.Форма.ФормаДокумента", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
			Иначе
				
				ТекстСообщения = НСтр("ru='Перед добавлением событий, необходимо ввести сумму договора.';
									  |en='Before adding events, you must enter the amount of the contract.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;

		ИначеЕсли ВариантРедактирования = "Изменение" Тогда
			ТекущиеДанные = Элементы.СписокСобытий.ТекущиеДанные;
			ОткрытьЗначение(ТекущиеДанные.Ссылка);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ВопросСписокСобытийПередНачаломДобавления()

&НаКлиенте
Процедура СписокСобытийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru='Данные изменены. Перед началом работы с событиями данные необходимо записать. Записать?';
							|en='Data has changed. Before working with the events of the data to be written. Record?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросСписокСобытийПередНачаломДобавления", ЭтотОбъект, "Изменение");		
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30,,);
		
	Иначе
		
		ТекущиеДанные = Элементы.СписокСобытий.ТекущиеДанные;
		ПоказатьЗначение(,ТекущиеДанные.Ссылка);
		
	КонецЕсли;
		
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура СписокСобытийПередНачаломИзменения(Элемент, Отказ)
	
	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru='Данные изменены. Перед началом работы с событиями данные необходимо записать. Записать?';
							|en='Data has changed. Before working with the events of the data to be written. Record?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросСписокСобытийПередНачаломДобавления", ЭтотОбъект, "Изменение");		
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30,,);
		
	Иначе
		
		ТекущиеДанные = Элементы.СписокСобытий.ТекущиеДанные;
		ОткрытьЗначение(ТекущиеДанные.Ссылка);

	КонецЕсли;
		
	Отказ = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДопУсловияПоДоговору

&НаКлиенте
Процедура ДопУсловияПоДоговоруПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДопУсловияПоДоговору.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ГрафикПлатежей.Параметры.УстановитьЗначениеПараметра("ДокДопУсловия" , мКэшЗначений.ПустойДокументДопУсловияПоДоговору);
		ГрафикНачислений.Параметры.УстановитьЗначениеПараметра("ДокДопУсловия", мКэшЗначений.ПустойДокументДопУсловияПоДоговору);
	Иначе
		ГрафикПлатежей.Параметры.УстановитьЗначениеПараметра("ДокДопУсловия" , ТекущиеДанные.Ссылка);
		ГрафикНачислений.Параметры.УстановитьЗначениеПараметра("ДокДопУсловия", ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДопУсловияПоДоговоруПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Модифицированность Тогда
		ТекстПредупреждения = НСтр("ru='Данные изменены. Перед добавлением ""Дополнительных условий по договору"" данные необходимо записать.';
								  |en='These modified. Before adding, ""Additional Terms of the contract,"" the data to be written.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	    Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначенияПараметровФинДоговоров

&НаКлиенте
Процедура ЗначенияПараметровФинДоговоровЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияПараметровФинДоговоров.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	бит_РаботаСДиалогамиКлиент.ОчисткаЗначенияПараметраСоставляющейПлатежа(ТекущиеДанные, "Параметр", "Значение", СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПараметровФинДоговоровЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗначенияПараметровФинДоговоров.ТекущиеДанные;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтатьяОборотовБДДСПоступление"	, мКэшЗначений.СтатьяОборотовБДДСПоступление);
	СтруктураПараметров.Вставить("СтатьяОборотовБДДСРасходование"	, мКэшЗначений.СтатьяОборотовБДДСРасходование);
	СтруктураПараметров.Вставить("СтатьяОборотовБДРПоступление"		, мКэшЗначений.СтатьяОборотовБДРПоступление);
	СтруктураПараметров.Вставить("СтатьяОборотовБДРРасходование"	, мКэшЗначений.СтатьяОборотовБДРРасходование);
	СтруктураПараметров.Вставить("Перечисления"						, мКэшЗначений.Перечисления);
	СтруктураПараметров.Вставить("ИмяРеквизитаЗначение"				, "Значение");
	СтруктураПараметров.Вставить("ИмяРеквизитаТипПлатежа"			, "ТипПлатежа");
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораЗначенияПараметраСоставляющейПлатежа(ЭтотОбъект, Элемент, ТекущиеДанные, СтруктураПараметров, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатьиОборотов

&НаКлиенте
Процедура бит_СтатьиОборотовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.бит_СтатьиОборотов.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		
		Если НЕ мКэшЗначений.СписокДоступныхНаправлений.Количество() = 0 Тогда 
			ТекущиеДанные.РасходДоход = мКэшЗначений.СписокДоступныхНаправлений[0].Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатьиОборотовПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.бит_СтатьиОборотов.ТекущиеДанные;
	
	Если НЕ Отказ Тогда
		
		Если ТекущиеДанные.СтатьяОборотов = Объект.бит_ОсновнаяСтатьяОборотов Тогда
			Объект.бит_ОсновнаяСтатьяОборотов = Неопределено;
		КонецЕсли;
		
		Если ТекущиеДанные.СтатьяОборотов = Объект.бит_ОсновнаяСтатьяОборотовБДР Тогда
			Объект.бит_ОсновнаяСтатьяОборотовБДР = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатьиОборотовПослеУдаления(Элемент)
	
	Если Объект.бит_СтатьиОборотов.Количество() = 0 Тогда
		Объект.бит_ОсновнаяСтатьяОборотов = Неопределено;
		Объект.бит_ОсновнаяСтатьяОборотовБДР = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатьиОборотовРасходДоходНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.ЗагрузитьЗначения(мКэшЗначений.СписокДоступныхНаправлений.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатьиОборотовРасходДоходПриИзменении(Элемент)
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатьиОборотовСтатьяОборотовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.бит_СтатьиОборотов.ТекущиеДанные;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РасходДоход", ТекущиеДанные.РасходДоход);
		
	бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элемент, СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_СтатьиОборотовСтатьяОборотовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.бит_СтатьиОборотов.ТекущиеДанные;
	
	ИзменениеСтатьиОборотов(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьФактическийПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала 	= Объект.бит_ФактическоеНачало;
	Диалог.Период.ДатаОкончания = Объект.бит_ФактическоеОкончание;
	Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
	ДопПараметров = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ВыборФактическогоПериодаЗавершение", ЭтотОбъект, ДопПараметров);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыборФактическогоПериодаЗавершение".
//
// Параметры:
// Период 				- СтандартныйПериод.
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ВыборФактическогоПериодаЗавершение(Период, ДополнительныеДанные) Экспорт

	Если Период <> Неопределено Тогда
	
		Объект.бит_ФактическоеНачало    = Период.ДатаНачала;
		Объект.бит_ФактическоеОкончание = Период.ДатаОкончания;
				
	КонецЕсли; 
	
КонецПроцедуры	// ВыборФактическогоПериодаЗавершение

&НаКлиенте
Процедура НастроитьПлановыйПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала 	= Объект.бит_НачалоПлановое;
	Диалог.Период.ДатаОкончания = Объект.бит_ОкончаниеПлановое;
	Диалог.Период.Вариант		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		
	ДопПараметров = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ВыборПлановогоПериодаЗавершение", ЭтотОбъект, ДопПараметров);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Процедура обработчик оповещения "ВыборПлановогоПериодаЗавершение".
//
// Параметры:
// Период 				- СтандартныйПериод.
// ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ВыборПлановогоПериодаЗавершение(Период, ДополнительныеДанные) Экспорт

	Если Период <> Неопределено Тогда
	
		Объект.бит_НачалоПлановое    = Период.ДатаНачала;
		Объект.бит_ОкончаниеПлановое = Период.ДатаОкончания;
				
	КонецЕсли; 
	
КонецПроцедуры	// ВыборПлановогоПериодаЗавершение

&НаКлиенте
Процедура УстановитьОсновнуюСтатьюОборотов(Команда)
	
	ТекущиеДанные = Элементы.бит_СтатьиОборотов.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		УстановитьОсновнуюСтатьюОборотовСервер(ТекущиеДанные.СтатьяОборотов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПретензию(Команда)
	
	СоздатьИскПретензию("Претензия");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИсковоеТребование(Команда)
	
	СоздатьИскПретензию("Иск");
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ПрочитатьДанныеДоговораКонтрагента();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсторияПлановогоОкончания(Команда)
	
	ПредставлениеРеквизита = НСтр("ru='Окончание плановое';en='Planned ending'");
	бит_РаботаСДиалогамиКлиент.ОткрытьИсторию(Объект.ДоговорКонтрагента, "бит_ОкончаниеПлановое", ПредставлениеРеквизита, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Модифицированность = НЕ СохранитьИзменения();
	
	ВыполнитьПослеЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()
	
	мКэшЗначений = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	КэшПеречисления.Вставить("бит_РасходДоход"								 , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_РасходДоход));
	КэшПеречисления.Вставить("бит_ТипыСтатейОборотов"						 , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ТипыСтатейОборотов));
	КэшПеречисления.Вставить("бит_ТипыПлатежейПоФинансовымДоговорам"		 , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам));
	КэшПеречисления.Вставить("бит_АлгоритмыРасчетовПоФинДоговорам"			 , бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_АлгоритмыРасчетовПоФинДоговорам));
	КэшПеречисления.Вставить("бит_КонтекстыВыполненияПользовательскихФункций", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_КонтекстыВыполненияПользовательскихФункций));
	
	мКэшЗначений.Вставить("Перечисления", КэшПеречисления);
	
	мКэшЗначений.Вставить("СтатьяОборотовБДДСПоступление" , ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.СтатьяОборотовБДДСПоступление);
	мКэшЗначений.Вставить("СтатьяОборотовБДДСРасходование", ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.СтатьяОборотовБДДСРасходование);
	мКэшЗначений.Вставить("СтатьяОборотовБДРПоступление"  , ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.СтатьяОборотовБДРПоступление);
	мКэшЗначений.Вставить("СтатьяОборотовБДРРасходование" , ПланыВидовХарактеристик.бит_ВидыПараметровФинансовыхДоговоров.СтатьяОборотовБДРРасходование);

	мКэшЗначений.Вставить("СписокДоступныхНаправлений", СформироватьСписокДоступныхНаправлений());
	Элементы.бит_СтатьиОборотовРасходДоход.СписокВыбора.ЗагрузитьЗначения(мКэшЗначений.СписокДоступныхНаправлений.ВыгрузитьЗначения());
	
	
	мКэшЗначений.Вставить("ЕстьОбъектыМСФО", бит_ОбщегоНазначения.ЕстьОбъектыМСФО());
	
	мКэшЗначений.Вставить("ЗакрытиеФормы", Ложь);
	
	мКэшЗначений.Вставить("ПустойДокументДопУсловияПоДоговору", Документы.бит_ДополнительныеУсловияПоДоговору.ПустаяСсылка());

КонецПроцедуры // ЗаполнитьКэшЗначений()

// Формирует кэш значений реквизитов формы
//
&НаСервере
Процедура ЗаполнитьКэшРеквизитовФормы()
	
	Для Каждого КэшРеквизита Из фКэшРеквизитов Цикл
		
		фКэшРеквизитов[КэшРеквизита.Ключ] = Объект[КэшРеквизита.Ключ];
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	флВидимостьФинРеквизитов = ВидимостьФинРеквизитов();
	
	// Видимость элементов.
	Элементы.ГруппаСтраницаПараметрыФинИнструментовМСФО.Видимость = мКэшЗначений.ЕстьОбъектыМСФО;

	Элементы.ГруппаСтраницаПараметрыФинансовыхДоговоров.Видимость = флВидимостьФинРеквизитов;

	Если ПравоДоступа("Изменение", Метаданные.РегистрыСведений.бит_ЗначенияПараметровФинансовыхДоговоров) Тогда
		Элементы.бит_СпособРасчетаФинПлатежей.Доступность 	   = Истина;
		Элементы.ЗначенияПараметровФинДоговоров.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.бит_СпособРасчетаФинПлатежей.Доступность 	   = Ложь;
		Элементы.ЗначенияПараметровФинДоговоров.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// Страница "Графики".
	ДопУсловияПоДоговору.Параметры.УстановитьЗначениеПараметра("ВыводитьСписок", ЗначениеЗаполнено(Объект.ДоговорКонтрагента));
	
	ТекущиеДанные = Элементы.ДопУсловияПоДоговору.ТекущаяСтрока;
	Если ТекущиеДанные = Неопределено Тогда
		ГрафикПлатежей.Параметры.УстановитьЗначениеПараметра("ДокДопУсловия"  , мКэшЗначений.ПустойДокументДопУсловияПоДоговору);
		ГрафикНачислений.Параметры.УстановитьЗначениеПараметра("ДокДопУсловия", мКэшЗначений.ПустойДокументДопУсловияПоДоговору);
	Иначе
		ГрафикПлатежей.Параметры.УстановитьЗначениеПараметра("ДокДопУсловия"  , ТекущиеДанные.Ссылка);
		ГрафикНачислений.Параметры.УстановитьЗначениеПараметра("ДокДопУсловия", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.СоглашенияСКлиентами") 
		ИЛИ ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.СоглашенияСПоставщиками") 
		ИЛИ ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
		
		Элементы.ГруппаУсловияОплатыНачислений.Видимость = Ложь;
		Элементы.ГруппаГрафики.Видимость = Ложь;
		
	ИначеЕсли бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды() 
			  И ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыАренды")Тогда
		
		Элементы.ГруппаУсловияОплатыНачислений.Видимость = Ложь;
		
	Иначе
		
		// Определяем видимость вкладки "Услвоия оплаты".
		Если Объект.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.АрендаОС 
			Или Объект.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыВыданные
			Или Объект.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыПолученные
			Или Объект.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.КредитыПолученные
			Или Объект.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЦенныеБумаги Тогда
			Элементы.ГруппаУсловияОплатыНачислений.Видимость = Ложь;
		Иначе
			Элементы.ГруппаУсловияОплатыНачислений.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
		Элементы.ГруппаПретензионноИсковаяРабота.Видимость = Ложь;
	КонецЕсли;
	
	// Установим видимость колонки "Событие".
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) И НЕ ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
		Если ЕстьСобытияДоговора(Объект.ДоговорКонтрагента) И Не НедопустимыйТип(Объект.ДоговорКонтрагента.бит_ТипДоговора) Тогда
			Элементы.ГрафикПлатежейГруппаСостояние.Видимость = Истина;
		Иначе
			Элементы.ГрафикПлатежейГруппаСостояние.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ВидимостьФинРеквизитов()

	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента)
		И (ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"))
		И (Объект.бит_НаправлениеДоговора = Справочники.бит_НаправленияДоговоров.Финансовый
		ИЛИ Объект.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.КредитыПолученные
		ИЛИ Объект.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыВыданные
		ИЛИ Объект.бит_ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыПолученные) Тогда
		
		Результат = Истина;
	КонецЕсли;
							
	Возврат Результат;						
	
КонецФункции

// Процедура - обработчик ожидания. Проверяет форму на активность
//
&НаКлиенте
Процедура ПроверитьАктивностьФормы()
	
	Если НЕ ФормаАктивна
		И ВводДоступен() Тогда
		
		ИзменениеДанныхРазрешено();
		
	КонецЕсли;
	
	ФормаАктивна = ВводДоступен();
	
КонецПроцедуры

// Функция управляет доступностью формы на основании данных о модифицированности формы владельца
//
&НаКлиенте
Функция ИзменениеДанныхРазрешено()
	
	флРазрешено = Истина;
	
	Если ВладелецФормы.Модифицированность Тогда
		
		флРазрешено = Ложь;
		
	КонецЕсли;	
	
	ТолькоПросмотр = НЕ флРазрешено;
	
	Возврат флРазрешено;
	
КонецФункции

// Выполняет необходимые действия после записи данных в форме
//
&НаКлиенте
Процедура ВыполнитьПослеЗаписи()
	
	ОповеститьОбИзменении(Объект.ДоговорКонтрагента);
	
	# Если НЕ ВебКлиент Тогда
		
		// в режиме ВебКлиента обновление формы владельца приводит к ошибке
		Если НЕ ЭтотОбъект.ВладелецФормы = Неопределено Тогда
			
			Попытка
				
				ЭтотОбъект.ВладелецФормы.Прочитать();
				
			Исключение
				
			КонецПопытки;
			
		КонецЕсли; 
		
	# КонецЕсли 
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПараметрыФинИнструментовМУ()
	
	Если мКэшЗначений.ЕстьОбъектыМСФО Тогда
	 	ПараметрыФинИнструментовМУ.Параметры.УстановитьЗначениеПараметра("Дата", ДатаСведенийМУ);
		ПараметрыФинИнструментовМУ.Параметры.УстановитьЗначениеПараметра("ДоговорКонтрагента", Объект.ДоговорКонтрагента);	
	КонецЕсли;                                                                                                            	
	
КонецПроцедуры

// Устанавливаем отбор для списка событий. 
//
// Параметры:
//  Параметр1 - Строка.
//
&НаСервере
Процедура УстановитьОтборДляСпискаСобытий()

	ЭлементыОтбора = СписокСобытий.Отбор.Элементы;
    ЭлементыОтбора.Очистить();
	
	НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    НовыйЭлемент.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Договор");
    НовыйЭлемент.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
    НовыйЭлемент.ПравоеЗначение   = Объект.ДоговорКонтрагента;
    НовыйЭлемент.Применение       = ТипПримененияОтбораКомпоновкиДанных.Элементы;
	
	НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    НовыйЭлемент.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Организация");
    НовыйЭлемент.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
    НовыйЭлемент.ПравоеЗначение   = Объект.ДоговорКонтрагента.Организация;
    НовыйЭлемент.Применение       = ТипПримененияОтбораКомпоновкиДанных.Элементы;	

	НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    НовыйЭлемент.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Контрагент");
    НовыйЭлемент.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
    НовыйЭлемент.ПравоеЗначение   = Объект.ДоговорКонтрагента.Контрагент;
    НовыйЭлемент.Применение       = ТипПримененияОтбораКомпоновкиДанных.Элементы;
	
КонецПроцедуры // УстановитьОтборДляСпискаСобытий()

// Устанавливается значение параметра "Договор" для СписокПретензий и ИсковыеТребования
//
&НаСервере
Процедура УстановитьПараметрыДляСпискаТребованийИсков()
			
	СписокПретензийИсков.Параметры.УстановитьЗначениеПараметра("Договор",        Объект.ДоговорКонтрагента);
		
КонецПроцедуры

// Переносит сделанные изменения в договор
//
&НаСервере
Функция СохранитьИзменения()
	
	ОбъектДоговор = Объект.ДоговорКонтрагента.ПолучитьОбъект();
	
	ЗаполнитьЗначенияСвойств(ОбъектДоговор, Объект, , "бит_СтатьиОборотов");
	
	ОбъектДоговор.бит_СтатьиОборотов.Загрузить(Объект.бит_СтатьиОборотов.Выгрузить());
	
	Если не ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда		
		УстановитьОтборДляСпискаСобытий();
	КонецЕсли;
	
	флВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(ОбъектДоговор, , "Ошибки");
	
	Если флВыполнено Тогда
		
		// Запишем историю изменения "периодических" реквизитов.
		СтруктураПериодическихРеквизитов = Новый Структура;
		//СтруктураПериодическихРеквизитов.Вставить("бит_ОкончаниеПлановое");
		
		бит_ОбщегоНазначения.ЗаписатьИзмененияРеквизитов(ОбъектДоговор, ТекущаяДатаСеанса(), СтруктураПериодическихРеквизитов);
		
		// Запишем значения параметров финансового договора.
		ДеревоПараметров = РеквизитФормыВЗначение("ЗначенияПараметровФинДоговоров");
		
		бит_Договоры.ЗаписатьПараметрыФинансовогоДоговора(ОбъектДоговор.Ссылка, ДеревоПараметров);

	КонецЕсли;
	
	Возврат флВыполнено;
	
КонецФункции

// Перечитывает данные договора контрагента из базы и обновляет значения реквизитов обработки
//
&НаКлиенте
Процедура ПрочитатьДанныеДоговораКонтрагента()
			
	ЗаполнитьЗначенияСвойств(Объект, ВладелецФормы.Объект,,"бит_СтатьиОборотов");
	
	Если ТипЗнч(ВладелецФормы.Объект.Ссылка) = Тип("СправочникСсылка.СоглашенияСКлиентами") 
		ИЛИ ТипЗнч(ВладелецФормы.Объект.Ссылка) = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
		
		Объект.бит_ВалютаВзаиморасчетов = ВладелецФормы.Объект.Валюта;
		
	Иначе
		
		Объект.бит_ВалютаВзаиморасчетов = ВладелецФормы.Объект.ВалютаВзаиморасчетов;
		
	КонецЕсли;
	
	Объект.бит_СтатьиОборотов.Очистить();
	
	Для Каждого ТекСтрока Из ВладелецФормы.Объект.бит_СтатьиОборотов Цикл
		НоваяСтрока = Объект.бит_СтатьиОборотов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
		
	Если Не ЗначениеЗаполнено(Объект.бит_КурсВзаиморасчетов) Тогда
		УстановитьКурсКратностьДокумента(Объект.бит_ВалютаВзаиморасчетов, ВладелецФормы.Объект.Дата, Объект.бит_КурсВзаиморасчетов);
		//Объект.бит_КурсВзаиморасчетов = 1;
	КонецЕсли;
	ЗаполнитьПараметрыФинансовогоДоговора(Объект.ДоговорКонтрагента);
			
КонецПроцедуры

// Функция формирует список доступных для выбора направлений в зависимости от вида договора. 
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//   СписокНаправлений - СписокЗначений.
//
&НаСервере
Функция СформироватьСписокДоступныхНаправлений()
	
	СписокНаправлений = Новый СписокЗначений;	
	
	Если ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
		СписокНаправлений.Добавить(Перечисления.бит_РасходДоход.Поступление);
	ИначеЕсли ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.СоглашенияСПоставщиками")
		ИЛИ (бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды() 
		 	 И ТипЗнч(Объект.ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыАренды")) Тогда
		СписокНаправлений.Добавить(Перечисления.бит_РасходДоход.Расходование);
	Иначе
		
		Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента[бит_ОбщегоНазначения.ПолучитьВидДоговора()]) Тогда
			
			Если Объект.ДоговорКонтрагента[бит_ОбщегоНазначения.ПолучитьВидДоговора()] = Перечисления[бит_ОбщегоНазначения.ПолучитьИмяПеречисленияВидыДоговоровКонтрагентов()].СПоставщиком Тогда
				СписокНаправлений.Добавить(Перечисления.бит_РасходДоход.Расходование); 				
			ИначеЕсли Объект.ДоговорКонтрагента[бит_ОбщегоНазначения.ПолучитьВидДоговора()] = Перечисления[бит_ОбщегоНазначения.ПолучитьИмяПеречисленияВидыДоговоровКонтрагентов()].СПокупателем Тогда
				СписокНаправлений.Добавить(Перечисления.бит_РасходДоход.Поступление); 				
			Иначе
				СписокНаправлений.Добавить(Перечисления.бит_РасходДоход.Расходование);
				СписокНаправлений.Добавить(Перечисления.бит_РасходДоход.Поступление);
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокНаправлений;
	
КонецФункции // СформироватьСписокДоступныхНаправлений()

&НаСервере
Процедура ПриИзмененииЦФОСервер()
	
	ТекДатаОтбора = ТекущаяДатаСеанса();
	
	Для Каждого ТекСтрока Из Объект.бит_СтатьиОборотов Цикл
				
		ИзменениеСтатьиОборотов(ТекСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура проверяет принадлежность ЦФО к Статье оборотов.
//
// Параметры:
//  Контейнер 		  - ДанныеФормыСтруктура.
//  ВыводитьСообщения - Булево.
//  ИндексСтроки	  - Число, по умолчанию Неопределено.
//
&НаСервере 
Процедура ПроверитьПринадлежностьЦФОКСтатьеОборотов(ИДСтроки, ДатаОтбора)

	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП
	
КонецПроцедуры // ПроверитьПринадлежностьЦФОКСтатьеОборотов() 

// Функция получает список статей оборотов, принадлежащих данному ЦФО.
//
// Параметры:
//  ВыводитьСообщения - Булево.
//  ИндексСтроки 	  - Число, по умолчанию Неопределено.
//
// Возвращаемое значение:
//  СписокСтатей - СписокЗначений.
//
&НаСервере
Функция ПолучитьСписокСтатейПоПринадлежности(ИДСтроки, ДатаОтбора)
	
	// ++ ЕРП 
	Совместимо = Истина;
	// -- ЕРП
	
КонецФункции // ПолучитьСписокСтатейПоПринадлежностиМодуль()

&НаСервере
Функция ОтборыПроектовДоговоров()
	
	СтруктураОтбора = Новый Структура;
	
	СтруктураОтбора.Вставить("Организация", Объект.ДоговорКонтрагента.Организация);
	
    ИмяКонтрагент = бит_ОбщегоНазначения.ОпределитьИмяРеквизитаКонтрагента();
    СтруктураОтбора.Вставить("Контрагент", Объект.ДоговорКонтрагента[ИмяКонтрагент]);
	
	СтруктураОтбора.Вставить("ВидДоговора", Объект.ДоговорКонтрагента[бит_ОбщегоНазначения.ПолучитьВидДоговора()]);
	
	Возврат СтруктураОтбора;
	
КонецФункции

// Процедура обрабатывает изменение статьи оборотов в строке таблицы.
//
// Параметры:
//  Контейнер - СтрокаТабличнойЧасти.бит_СтатьиОборотов.
//
&НаСервере
Процедура ИзменениеСтатьиОборотов(ИДСтроки)

	Если ТипЗнч(ИДСтроки) = Тип("Число") Тогда
		Контейнер = Объект.бит_СтатьиОборотов.НайтиПоИдентификатору(ИДСтроки);
	Иначе
		Контейнер = ИДСтроки;
	КонецЕсли;
	
	Если Контейнер = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
    Если ЗначениеЗаполнено(Контейнер.СтатьяОборотов) Тогда
        
        Если Контейнер.СтатьяОборотов.ЭтоГруппа Тогда
			ТекстСообщения = НСтр("ru='Выбор групп статей запрещен';
								  |en='Selecting groups of items is prohibited'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
			Контейнер.СтатьяОборотов = Справочники.бит_СтатьиОборотов.ПустаяСсылка();			
			Возврат;
        КонецЕсли; 
        
        Если Контейнер.СтатьяОборотов.РасходДоход <> Контейнер.РасходДоход Тогда
			Если Контейнер.РасходДоход = Перечисления.бит_РасходДоход.Поступление Тогда
				ТекстСообщения = НСтр("ru='Следует выбрать доходную статью';
								  	  |en='Select revenue item'");
			Иначе	
				ТекстСообщения = НСтр("ru='Следует выбрать расходную статью';
								  	  |en='Select an expense item'");
			КонецЕсли;
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
			Контейнер.СтатьяОборотов = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
			Возврат;
        КонецЕсли; 
		
		// Если еще не указана основная статья оборотов, тогда
		Если Не ЗначениеЗаполнено(Объект.бит_ОсновнаяСтатьяОборотов)
			И Контейнер.СтатьяОборотов.ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДДС Тогда
			Объект.бит_ОсновнаяСтатьяОборотов = Контейнер.СтатьяОборотов;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.бит_ОсновнаяСтатьяОборотовБДР)
			И Контейнер.СтатьяОборотов.ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДР Тогда
			Объект.бит_ОсновнаяСтатьяОборотовБДР = Контейнер.СтатьяОборотов;
		КонецЕсли;
		
	КонецЕсли; 
    
КонецПроцедуры // бит_ИзменениеСтатьиОборотов()

&НаСервере
Процедура УстановитьОсновнуюСтатьюОборотовСервер(СтатьяОборотов)
	
	Если НЕ ЗначениеЗаполнено(СтатьяОборотов) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтатьяОборотов.ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДДС Тогда
		Объект.бит_ОсновнаяСтатьяОборотов = СтатьяОборотов;
	ИначеЕсли СтатьяОборотов.ТипСтатьи = Перечисления.бит_ТипыСтатейОборотов.БДР Тогда 
		Объект.бит_ОсновнаяСтатьяОборотовБДР = СтатьяОборотов;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура бит_ТипДоговораПриИзмененииСервер()
	
	УправлениеЭлементамиФормы();
	ПроверитьПараметрыФинДоговора();
		
КонецПроцедуры

&НаСервере
Процедура бит_НаправлениеДоговораПриИзмененииСервер()
	
	УправлениеЭлементамиФормы();
	ПроверитьПараметрыФинДоговора();
		
КонецПроцедуры

// Создание иска или претензии.
// Параметры:
//   ВидДокумента - Строка.
//
&НаКлиенте
Процедура СоздатьИскПретензию(ВидДокумента)

	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru='Документ изменен, перед началом добавления исков или претензий его необходимо записать. Записать?';
							|en='The document is changed before adding actions or complaints must be recorded. Record?'");
		ОповещениеВопрос = Новый ОписаниеОповещения("ВопросСоздатьИскПретензию", ЭтотОбъект, ВидДокумента);
		ТекстЗаголовка = НСтр("ru='Документ изменен';en='Document was changed'");
		ПоказатьВопрос(ОповещениеВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30,, ТекстЗаголовка);
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
		ПараметрыФормы.Вставить("Контрагент",  ВладелецФормы.Объект.Контрагент);
        ПараметрыФормы.Вставить("Организация", ВладелецФормы.Объект.Организация);
		ПараметрыПередачи = Новый Структура("Основание", ПараметрыФормы); 
		
		Если ВидДокумента = "Иск" Тогда
			ОткрытьФорму("Документ.бит_ИсковоеТребование.Форма.ФормаДокумента", ПараметрыПередачи,,ЭтотОбъект);
		Иначе
			ОткрытьФорму("Документ.бит_Претензия.Форма.ФормаДокумента", ПараметрыПередачи,,ЭтотОбъект);
		КонецЕсли;
						
	КонецЕсли;

КонецПроцедуры

// Обработка оповещения вопроса пользователю.
// Параметры:
//  Ответ - Строка.
//  ВидДокумента - Строка.
//
&НаКлиенте
Процедура ВопросСоздатьИскПретензию(Ответ, ВидДокумента) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Модифицированность = НЕ СохранитьИзменения();
		ВыполнитьПослеЗаписи();
			
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Договор", Объект.ДоговорКонтрагента);
		Если ВладелецФормы.Объект.Свойство("Контрагент") Тогда
			ПараметрыФормы.Вставить("Контрагент", ВладелецФормы.Объект.Контрагент);
		Иначе
			ПараметрыФормы.Вставить("Контрагент", ВладелецФормы.Объект.Владелец);
		КонецЕсли;
        ПараметрыФормы.Вставить("Организация", ВладелецФормы.Объект.Организация);
		
		Если ВидДокумента = "Иск" Тогда
	
			ОткрытьФорму("Документ.бит_ИсковоеТребование.Форма.ФормаДокумента", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе
			
			ОткрытьФорму("Документ.бит_Претензия.Форма.ФормаДокумента", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры


// Процедура расчитывает суммму НДС.
//
// Параметры:
//  Контейнер - Объект, СтрокаТабличнойЧасти.
//
&НаСервере 
Процедура РассчитатьСуммуНДС()

	СтавкаНДСЧисло = бит_СтавкиНДС.ЗначениеСтавкиНДС(Объект.бит_СтавкаНДС);	
	Объект.бит_СуммаНДСВзаиморасчеты = бит_БухгалтерияКлиентСервер.РассчитатьСуммуНДС(Объект.бит_СуммаДоговора, 
											Истина, Истина, СтавкаНДСЧисло);
																							
КонецПроцедуры // РассчитатьСуммуНДС()

// Процедура расчитывает суммму без НДС.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура РассчитатьСуммуБезНДС()

	ЭтотОбъект.СуммаБезНДС = Объект.бит_СуммаДоговора - Объект.бит_СуммаНДСВзаиморасчеты;
																							
КонецПроцедуры // РассчитатьСуммуБезНДС()

// Процедура заполняет значения реквизитов исходя из значений типового справочника.
//
// Параметры:
//
&НаКлиенте
Процедура ЗаполнитьРеквизитыПоУмолчанию()
		
	Если ЗначениеЗаполнено(ВладелецФормы.Объект.бит_ТипДоговора) Тогда
		Объект.бит_ТипДоговора = ВладелецФормы.Объект.бит_ТипДоговора;
	Иначе
		
		Если ВладелецФормы.Объект.ХарактерДоговора = ПредопределенноеЗначение("Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм") 
			И ВладелецФормы.Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговораКредитовИДепозитов.КредитВБанке") Тогда
			Объект.бит_ТипДоговора = ПредопределенноеЗначение("Справочник.бит_ТипыДоговоров.КредитыПолученные");
			
		ИначеЕсли ВладелецФормы.Объект.ХарактерДоговора = ПредопределенноеЗначение("Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм") Тогда
			Объект.бит_ТипДоговора = ПредопределенноеЗначение("Справочник.бит_ТипыДоговоров.ЗаймыПолученные");
			
		ИначеЕсли ВладелецФормы.Объект.ХарактерДоговора = ПредопределенноеЗначение("Перечисление.ХарактерыДоговоровФинансовыхИнструментов.ЗаймВыданный") Тогда
            Объект.бит_ТипДоговора = ПредопределенноеЗначение("Справочник.бит_ТипыДоговоров.ЗаймыВыданные");
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецФормы.Объект.бит_СуммаДоговора) Тогда
		Объект.бит_СуммаДоговора = ВладелецФормы.Объект.бит_СуммаДоговора;
	Иначе			
		Объект.бит_СуммаДоговора = ВладелецФормы.Объект.СуммаТраншей;			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецФормы.Объект.бит_СтавкаНДС) Тогда
		Объект.бит_СтавкаНДС = ВладелецФормы.Объект.бит_СтавкаНДС;
	Иначе
		Объект.бит_СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		
		Модифицированность = Истина;
		
	КонецЕсли;
						
КонецПроцедуры // ЗаполнитьРеквизитыПоУмолчанию()

// Процедура управляет видимостью элементов аналитики ТЧ "ГрафикПлатежей" и
// "ГрафикНачислений". 
//
// Параметры:
//
&НаСервере
Процедура УправлениеВидимостьюЭлементовТЧ(Область)
	
    МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Проекты"));
    МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
    МассивТипов.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
    МассивТипов.Добавить(Тип("СправочникСсылка.Подразделения"));
	//МассивТипов.Добавить(Тип("СправочникСсылка.ГруппыФинансовогоУчетаНоменклатуры"));

	Настр = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
	
	Для каждого Аналит Из Настр Цикл
		
		Если НЕ Аналит.Значение.ЭтоСоставнойТип Тогда 
		
			Для каждого СтрРекв Из МассивТипов Цикл
				
				ТипРек = СтрРекв;
				Если Аналит.Значение.ТипЗначения.СодержитТип(ТипРек) Тогда 
					Элементы["ГрафикПлатежей"+Аналит.Ключ].Видимость = Ложь;
					Элементы["ГрафикНачислений"+Аналит.Ключ].Видимость = Ложь;             
				КонецЕсли;
			
			КонецЦикла; 
			
		КонецЕсли;	
			
	КонецЦикла; 
	
КонецПроцедуры // УправлениеВидимостьюЭлементовТЧ()

// Процедура заполняет курс и кратность документа.
//
// Параметры:
//  Валюта
//	Дата
//	Курс
//	Кратность
//
&НаСервереБезКонтекста
Процедура УстановитьКурсКратностьДокумента(Валюта, Дата, Курс)
    
    СтрКурса = бит_КурсыВалют.ПолучитьКурсВалюты(Валюта, Дата);
    
    Курс      = СтрКурса.Курс;
	//Кратность = СтрКурса.Кратность;
    
КонецПроцедуры // ИзменениеВалюты()

// Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат - Строка.
//
&НаСервере
Функция НедопустимыйТип(ТипДоговора)

	Результат = Ложь;
	
	Если ТипДоговора = Справочники.бит_ТипыДоговоров.АрендаОС 
		Или ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыВыданные
		Или ТипДоговора = Справочники.бит_ТипыДоговоров.ЗаймыПолученные
		Или ТипДоговора = Справочники.бит_ТипыДоговоров.КредитыПолученные
		Или ТипДоговора = Справочники.бит_ТипыДоговоров.ЦенныеБумаги 
		Или ТипДоговора = Справочники.бит_НаправленияДоговоров.Финансовый Тогда

        Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НедопустимыйТип()

// Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат - Строка.
//
&НаСервере
Функция ЕстьСобытияДоговора(Договор)

	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_СобытиеДоговора.Ссылка) КАК КолвоСобытий
		|ИЗ
		|	Документ.бит_СобытиеДоговора КАК бит_СобытиеДоговора
		|ГДЕ
		|	бит_СобытиеДоговора.Договор = &Договор
		|	И бит_СобытиеДоговора.Организация = &Организация
		|	И бит_СобытиеДоговора.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Контрагент", Договор.Контрагент);
	Запрос.УстановитьПараметр("Организация", Договор.Организация);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.КолвоСобытий > 0 Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ЕстьСобытияДоговора()

// Процедура заполняет дерево параметров финансового договора.
// 
&НаСервере
Процедура ЗаполнитьПараметрыФинансовогоДоговора(ИсточникЗаполнения)
	
	ДеревоПараметров = бит_Договоры.ДанныеПараметровФинДоговоров(ИсточникЗаполнения);
	
	ЭлементыДереваВФорме = ЗначенияПараметровФинДоговоров.ПолучитьЭлементы();
	ЭлементыДереваВФорме.Очистить();
	
	Для Каждого ТекущаяВетка Из ДеревоПараметров.Строки Цикл
		
		НоваяСтрока = ЭлементыДереваВФорме.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяВетка);
		
		ЭлементыСтрокиРодителя = НоваяСтрока.ПолучитьЭлементы();
		
		Для Каждого ПодчиненнаяВетка Из ТекущаяВетка.Строки Цикл
			НоваяПодчиненнаяСтрока = ЭлементыСтрокиРодителя.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяПодчиненнаяСтрока, ПодчиненнаяВетка);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПараметрыФинДоговора()
	
	флВидимостьФинРеквизитов = ВидимостьФинРеквизитов();
	
	Если флВидимостьФинРеквизитов Тогда
		Возврат;
	КонецЕсли;
	
	Объект.бит_СпособРасчетаФинПлатежей = Неопределено;
	
	ЗначенияПараметровФинДоговоров.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

#КонецОбласти
